Testcases/Testcase.yml
---
modules:
  blazemeter:
    token: c8e6aeba201634749310ecb4:9cf7e9c564d4c05e4e69e52f0fb3d605b542b00fa8f7441c83d3864c14bfd6b310fd1ea8
  jmeter:
    memory-xmx: 1G
    
reporting:
  - module: blazemeter
    test: Taurus Local Demo- Test_Cases

execution:
- scenario: 
    script: Test_Case_Teacher.jmx
  concurrency: 1
  ramp-up: 100s
  hold-for: 1m
  
- scenario: 
    script: Test_Case_Admin.jmx
  concurrency: 1
  ramp-up: 100s
  hold-for: 1m
  
- scenario: 
    script: Test_Case_Parent.jmx
  concurrency: 1
  ramp-up: 100s
  hold-for: 1m